Tekla.Structures.TeklaStructuresInternal.TeklaStructuresTrackingInfo
Provides information about tracking in Tekla Structures

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresTrackingInfo.GetModelSessionID
Get the current model session ID
Returns: The model session Id
Remarks:
This method will synchronize with the main thread when called from another thread.
A deadlock can occur if the main thread is already blocked and waiting on the calling thread.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresTrackingInfo.GetSessionID
Get the session ID
Returns: The session Id
Remarks:
This method will synchronize with the main thread when called from another thread.
A deadlock can occur if the main thread is already blocked and waiting on the calling thread.